app/controllers/movies_controller.rb

SELECT "movies".* FROM "movies" WHERE "movies"."rating" IN ('G', 'R', 'PG-13', 'PG') ORDER BY release_date
---
  def index
    @all_ratings = Movie.ratings
    rts = @all_ratings
    order = ""
    if params.has_key?(:ratings)
      rts = params[:ratings].keys
      session[:ratings] = params[:ratings]
    else if session.has_key?(:ratings)
      params[:ratings] = session[:ratings]
      rts = params[:ratings].keys
      end
    end
    if params.has_key?(:sort)
      session[:sort] = params[:sort]
      order = params[:sort]
     else if session.has_key?(:sort)
      params[:sort] = session[:sort]
      order = params[:sort]
      end
     end
    @movies = Movie.find(:all, :conditions => { :rating => rts}, :order => order)